src/main/java/estimate.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Header />
	<soapenv:Body>
		<ns6:osaprulesRequest xmlns=""
			xmlns:ns6="http://osapruleapp1819EST/" xmlns:ns7="http://osapruleapp1819EST">
			<studyPeriodsInput>
				<osapStudyPeriods>
					<osapStudyPeriod>
						<accountNumber>18004781</accountNumber>
						<applicationID>118004641</applicationID>
						<applicationReceivedDate>2018-04-11</applicationReceivedDate>
						<applicationType>7</applicationType>
						<bookFee>2119</bookFee>
						<children12OrOlder>0</children12OrOlder>
						<childrenAged0to11>0</childrenAged0to11>
						<childrenWithChildCareCosts>0</childrenWithChildCareCosts>
						<completeFTHighSchool>2015-03-31</completeFTHighSchool>
						<compulsaryFees>1401</compulsaryFees>
						<costOfOneReturnTrip>0</costOfOneReturnTrip>
						<crownWardNowOrPriorTo18thBirthday>2
						</crownWardNowOrPriorTo18thBirthday>
						<currentResidencyInformation>1</currentResidencyInformation>
						<currentStatusInformation>9</currentStatusInformation>
						<dayCareCosts>0</dayCareCosts>
						<deafOutsideCanada>2</deafOutsideCanada>
						<disabilityFlag>1</disabilityFlag>
						<disabledChildren12OrOlder>0</disabledChildren12OrOlder>
						<eligibleForCommutingGrant></eligibleForCommutingGrant>
						<eligibleForTravelGrant></eligibleForTravelGrant>
						<everReceivedPostsecCertDegDip></everReceivedPostsecCertDegDip>
						<extendedCareMaintenanceFlag>2</extendedCareMaintenanceFlag>
						<fatherCurrYrCppContributions>0</fatherCurrYrCppContributions>
						<fatherCurrYrEiPremiums>0</fatherCurrYrEiPremiums>
						<fatherCurrYrIncomeVerifiedDate>0</fatherCurrYrIncomeVerifiedDate>
						<fatherCurrYrNonTaxableIncome>0</fatherCurrYrNonTaxableIncome>
						<fatherCurrYrTaxPayable>0</fatherCurrYrTaxPayable>
						<fatherCurrYrTotalIncome>0</fatherCurrYrTotalIncome>
						<fatherOverrideFlag></fatherOverrideFlag>
						<fatherPrevYrCppContributions>0</fatherPrevYrCppContributions>
						<fatherPrevYrEiPremiums>0</fatherPrevYrEiPremiums>
						<fatherPrevYrIncomeVerifiedDate>0</fatherPrevYrIncomeVerifiedDate>
						<fatherPrevYrNonTaxableIncome>0</fatherPrevYrNonTaxableIncome>
						<fatherPrevYrTaxPayable>0</fatherPrevYrTaxPayable>
						<fatherPrevYrTotalIncome>0</fatherPrevYrTotalIncome>
						<fatherSinIndicator>1</fatherSinIndicator>
						<fatherWithin40km>2</fatherWithin40km>
						<govIncomeDuringStudyCPP>0</govIncomeDuringStudyCPP>
						<govIncomeDuringStudyEI>0</govIncomeDuringStudyEI>
						<govIncomeDuringStudyJobGrant>0</govIncomeDuringStudyJobGrant>
						<govIncomeDuringStudyODSP>0</govIncomeDuringStudyODSP>
						<govIncomeDuringStudyOntarioWorks>0
						</govIncomeDuringStudyOntarioWorks>
						<govIncomeDuringStudyOther>0</govIncomeDuringStudyOther>
						<govIncomeDuringStudyPsStudentSupport>0
						</govIncomeDuringStudyPsStudentSupport>
						<govIncomeDuringStudySecondCareer>0
						</govIncomeDuringStudySecondCareer>
						<govIncomeDuringStudyWSIB>0</govIncomeDuringStudyWSIB>
						<grossIncomeFromScholarship>0</grossIncomeFromScholarship>
						<institutionCode>EUAV</institutionCode>
						<livingWithParentsDuringStudyPeriod>2
						</livingWithParentsDuringStudyPeriod>
						<masterStatus>O</masterStatus>
						<meritBasedScholarship>0</meritBasedScholarship>
						<motherCurrYrCppContributions>0</motherCurrYrCppContributions>
						<motherCurrYrEiPremiums>0</motherCurrYrEiPremiums>
						<motherCurrYrIncomeVerifiedDate>0</motherCurrYrIncomeVerifiedDate>
						<motherCurrYrNonTaxableIncome>0</motherCurrYrNonTaxableIncome>
						<motherCurrYrTaxPayable>0</motherCurrYrTaxPayable>
						<motherCurrYrTotalIncome>0</motherCurrYrTotalIncome>
						<motherOverrideFlag></motherOverrideFlag>
						<motherPrevYrCppContributions>0</motherPrevYrCppContributions>
						<motherPrevYrEiPremiums>0</motherPrevYrEiPremiums>
						<motherPrevYrIncomeVerifiedDate>0</motherPrevYrIncomeVerifiedDate>
						<motherPrevYrNonTaxableIncome>0</motherPrevYrNonTaxableIncome>
						<motherPrevYrTaxPayable>0</motherPrevYrTaxPayable>
						<motherPrevYrTotalIncome>0</motherPrevYrTotalIncome>
						<motherSinIndicator></motherSinIndicator>
						<motherWithin40km></motherWithin40km>
						<originalStudyPeriodStart>2018-08-29</originalStudyPeriodStart>
						<overrideCost>2</overrideCost>
						<overrideDateCode>7</overrideDateCode>
						<parentsDependantChildren>1</parentsDependantChildren>
						<parentsMaritalStatus>4</parentsMaritalStatus>
						<parentsResponsibleParty>1</parentsResponsibleParty>
						<partner60PercentCourseLoad>1</partner60PercentCourseLoad>
						<partnerCompleteHighSchool>1900-01-01</partnerCompleteHighSchool>
						<partnerCurrYrCppContributions>0</partnerCurrYrCppContributions>
						<partnerCurrYrEiPremiums>0</partnerCurrYrEiPremiums>
						<partnerCurrYrIncomeVerifiedDate>0
						</partnerCurrYrIncomeVerifiedDate>
						<partnerCurrYrNonTaxableIncome>0</partnerCurrYrNonTaxableIncome>
						<partnerCurrYrTaxPayable>0</partnerCurrYrTaxPayable>
						<partnerCurrYrTotalIncome>0</partnerCurrYrTotalIncome>
						<partnerPrevYrCppContributions>0</partnerPrevYrCppContributions>
						<partnerPrevYrEiPremiums>0</partnerPrevYrEiPremiums>
						<partnerPrevYrIncomeVerifiedDate>0
						</partnerPrevYrIncomeVerifiedDate>
						<partnerPrevYrNonTaxableIncome>0</partnerPrevYrNonTaxableIncome>
						<partnerPrevYrTaxPayable>0</partnerPrevYrTaxPayable>
						<partnerPrevYrTotalIncome>0</partnerPrevYrTotalIncome>
						<partnerProgram12WeekYN></partnerProgram12WeekYN>
						<partnerReceivingCPPD></partnerReceivingCPPD>
						<partnerReceivingEI></partnerReceivingEI>
						<partnerReceivingODSP></partnerReceivingODSP>
						<partnerReceivingOW></partnerReceivingOW>
						<partnerStatusStartStudy></partnerStatusStartStudy>
						<percentageOfCourseLoad>59</percentageOfCourseLoad>
						<programCostCode></programCostCode>
						<programEndDate>2019-04-26</programEndDate>
						<programStartDate>2018-08-29</programStartDate>
						<resp>0</resp>
						<rrspNetValue>0</rrspNetValue>
						<secondEntryProgram>N</secondEntryProgram>
						<socialInsuranceNumber>123456789</socialInsuranceNumber>
						<studentPrevYrIncomeVerifiedDate>0
						</studentPrevYrIncomeVerifiedDate>
						<studentPrevYrNonTaxableIncome>0</studentPrevYrNonTaxableIncome>
						<studentPrevYrTotalIncome>0</studentPrevYrTotalIncome>
						<studentSocialAssistanceTypePriorToStudy></studentSocialAssistanceTypePriorToStudy>
						<studyPeriodEmployment>0</studyPeriodEmployment>
						<studyPeriodWeeks>35</studyPeriodWeeks>
						<studyViaCorrespondence>2</studyViaCorrespondence>
						<totalDependantsInPostSec>1</totalDependantsInPostSec>
						<totalNoOfYearsInProgram>4</totalNoOfYearsInProgram>
						<totalOtherAssets>0</totalOtherAssets>
						<tuitionFees>6220</tuitionFees>
						<yearProgramEntering>1</yearProgramEntering>
						<reviewStudentTransaction>
							<amountReviews>2</amountReviews>
							<reviewCode>PPS</reviewCode>
						</reviewStudentTransaction>
						<reviewStudentTransaction>
							<amountReviews>1</amountReviews>
							<reviewCode>DDC</reviewCode>
						</reviewStudentTransaction>
						<reviewStudentTransaction>
							<amountReviews>1</amountReviews>
							<reviewCode>DDT</reviewCode>
						</reviewStudentTransaction>
						<reviewStudentTransaction>
							<amountReviews>5</amountReviews>
							<reviewCode>OTP</reviewCode>
						</reviewStudentTransaction>
						<reviewStudentTransaction>
							<amountReviews>2</amountReviews>
							<reviewCode>OTT</reviewCode>
						</reviewStudentTransaction>
						<reviewStudentTransaction>
							<amountReviews>12</amountReviews>
							<reviewCode>OTL</reviewCode>
						</reviewStudentTransaction>
						<studentMaster>
							<citizenship>1</citizenship>
							<studentBirthDate>1990-04-02</studentBirthDate>
							<studentIndigenousStatus>2</studentIndigenousStatus>
						</studentMaster>
						<institutionTable>
							<cslDesignationDate>1988-12-21</cslDesignationDate>
							<eligibilityCode>3</eligibilityCode>
							<institutionType>1</institutionType>
							<programCosts>1</programCosts>
						</institutionTable>
						<costTable>
							<academicYear>1819</academicYear>
							<apsNumber>13900</apsNumber>
							<bookFees>1028</bookFees>
							<caatCode></caatCode>
							<compulsoryFees>1401</compulsoryFees>
							<coopFlag>N</coopFlag>
							<courseApproved>N</courseApproved>
							<courseDescription>PHYSICAL ED HLTH / KINESIOLOGY
							</courseDescription>
							<courseLength>4</courseLength>
							<deregulatedFlag>N</deregulatedFlag>
							<expendableSupplies>51</expendableSupplies>
							<facultyDivision>7</facultyDivision>
							<fieldTripAndLocalTran>250</fieldTripAndLocalTran>
							<fineArts>N</fineArts>
							<graduateThesisCosts>0</graduateThesisCosts>
							<institutionCode>EUAV</institutionCode>
							<lastUpdateDate>2017-08-04</lastUpdateDate>
							<lastUpdateTime>1501869574357</lastUpdateTime>
							<lastUserToChange>ADHOC</lastUserToChange>
							<levelOfStudy>3</levelOfStudy>
							<locationCode>28</locationCode>
							<majorEquipment>0</majorEquipment>
							<professionalExamFees>0</professionalExamFees>
							<programCode>28</programCode>
							<programEligibility></programEligibility>
							<programEndDate>2019-04-26</programEndDate>
							<programPath>28</programPath>
							<programStartDate>2018-08-29</programStartDate>
							<sequenceNumber>808543</sequenceNumber>
							<studyPeriodTotalWeeks>35</studyPeriodTotalWeeks>
							<totalBookCosts>2119</totalBookCosts>
							<tuitionFees>6220</tuitionFees>
							<uniformAndEquipment>290</uniformAndEquipment>
							<year>1</year>
						</costTable>
					</osapStudyPeriod>
				</osapStudyPeriods>
			</studyPeriodsInput>
		</ns6:osaprulesRequest>
	</soapenv:Body>
</soapenv:Envelope>